package javarush.Sintaksis.Yroven0.lesson4;
/*
Мой юный друг
*/
/*Сейчас 3126 год. Мой друг родился 8 лет назад.
Написать программу, выводящую на экран год рождения моего друга.*/
public class Task2 {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println(3118);
    }
}
